       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM.
       AUTHOR. BAKER.

       PROCEDURE DIVISION.

       MAINLINE.
           DISPLAY 'Hello, world!'.
           STOP RUN.
