       IDENTIFICATION DIVISION.
       PROGRAM-ID.  HELLOWORLD.
       AUTHOR. BAKER.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       MAINLINE.
           DISPLAY 'Hello, world!'.
           STOP RUN.
